{
    "active": {
        "portfolio": true,
        "notHome": true
    },
    "name": "Muir Woods Coffee House",
    "role": [
        "UX/UI Designer + Frontend Developer"
    ],
    "type": "Website Redesign",
    "description": "Located on the UCSD campus, Muir Woods Coffee House (Muir Woods, for short) is a popular destination among students, faculty, staff, and visitors-alike to get coffee, study, and hangout. Over the course of 10 weeks, my team members and I worked on branding, designing, and implementing a website for Muir Woods. We worked closely with Justin, the Director, through out the duration of the project.",
    "body": [{
        "header": "Client Survey",
        "content": [
            "To get a little more perspective, we sat down with Justin for an initial interview about the background of Muir Woods, user demographics, and his vision for the website. After the interview, we sat down to compile and analyze his responses. From there, we abstracted and documented initial design ideas for the website.",
            "Overall, we found one central theme: Muir Woods is more than just the coffee; it's the people that work, study, and hang out in the space that is Muir Woods. Justin emphasized that his ideal website would be:",
            "<ul><li>Comfortable - The user shouldn't feel sold to</li> <li>Familiar - Let the user get to know more about Muir Woods</li> <li>Engaging - Let the personality of the website engage the user</li></ul>",
            "With that in mind, we knew we shouldn't embrace the traditional model of retail-oriented sites."
        ],
        "link": {
             "asset": "Client Survey (PDF)",
             "path": "./public/documents/mwch/ClientSurvey.pdf"
        }
    },
    {
        "header": "User Interviews",
        "content": [
            "From our initial interview with the client, we garnered that the user group we should be targeting for the website are UCSD students. As students ourselves, we already had some ideas of what we thought should be included on the website. But every user is different and conducting user interviews gave us a greater perspective about how others would use the website.",
            "We interviewed a total of 9 users and broke down our questions based on their prior experience with Muir Woods. Every interviewee answered a set of general interview questions that targeted what they expected from any coffee shop and a set of questions after a similar website walkthrough. For the walkthrough, we chose a well-known, clearly branded, business and retail-oriented coffee company. By going to the other extreme, we thought it would be useful to see what big companies do well and what they didn’t. With that knowledge, we could really focus on the advantages of a small, community-oriented coffee shop like Muir Woods.",
            "From there, we diverged into two sets of specific interview questions. For interviewees who have never been to Muir Woods, we had them answer interview questions for potential customers. These questions were generalized to any coffee shop, but we asked them more specifically about their behaviors and preferences in regards to their prior experiences in other coffee shops. For interviewees who have been to Muir Woods, we asked them specifically about Muir Woods—their impressions, their experiences, why Muir Woods, and so on.",
            "After consolidating our data, we broke down our main user groups as follows: <ul><li>Potential UCSD Student Customers (On and Off Campus)</li> <li>Off-Campus UCSD Student Continuing/Past Customers</li> <li>On-Campus UCSD Student Continuing/Past Customers</li></ul>"
         ],
         "link": {
               "asset": "User Interviews (PDF)",
               "path": "./public/documents/mwch/UserInterview.pdf"
         }
    },
   {
      "header": "Competitive Analysis",
      "content": [
         "For our competitive analysis, we looked at 5 competitor websites, ranging from well-known companies to lesser known shops, and highlighted the positives and negatives of each website's brand, functionality, content, site architecture, navigation, and design. Through our analysis, we came to form the initial framework of our website design for Muir Woods by comparing the contents of competitor sites with the wishes, wants, and needs of our client. Our findings included concrete ideas about what the website needs or doesn't need, as well as some initial thoughts into the aesthetics.",
         "At this point in the process, we created a creative brief which laid out exactly what we wanted in terms of navigation, brand, information architecture, and layout/design. Our direction for the website was documented in a creative brief, which gave the client a better understanding of what to expect from the final website, along with some potential challenges that we were likely to encounter moving forward.",
         "In terms of navigation and information architecture, we decided upon four main sections of the website: About - 3 subpages: \"Background & Mission Statement\", \"Meet the Muiristas\", and \"Where We Source From\", Menu - Lists products and prices; Chalkboard themed, Stories - A request of the client; A sort-of \"testimonials\" page, Gallery - High quality photos of daily life at Muir Woods.",
         "In terms of personality and tone, it was clear to us that the website had to feel comfortable and personable. This was not only something the client expressed, but it was also evident to us that our user interviewees felt that that was the essence of Muir Woods."
      ],
      "link": {
            "asset": "Creative Brief (PDF)",
            "path": "./public/documents/mwch/CreativeBrief.pdf"
      }
   },
   {
      "header": "Early Concept",
      "content": [
         "After the initial information gathering, we started to conceptualize the visual design by whiteboarding. Pictured below are the early iterations of the About pages and the Stories page, respectively."
      ],
      "image": [
         {
         "title": "",
         "path": "./public/img/mwch/whiteboarding.png"
      }
   ]
},
   {
      "header": "Wireframes",
      "content": [
         "The wireframes were created collaboratively with Axure. Axure enabled us to generate HTML files of our wireframes, allowing us to dynamically showcase some interactivity of the design. Also included in the wireframes are blue notes on the functional specifications of interactive components of our website and as such, they should not be regarded as part of the design."
      ],
      "link": {
            "asset": "Interactive Wireframe (HTML)",
            "path": "/mwch-wireframe"
         }
   },
   {
      "header": "Mockups",
      "content": [
         "After feedback and careful consideration, we made some changes to the design and layout of the website. One of the most significant and noticeable changes was our decision to combine all subpages under a category into one page. That is, we combined all the subpages under \"About\" into one page, and all the subpages under \"Menu\" into one menu.",
         "We noted that combining the About pages into one page would make the page quite long. That meant that the current style of the navigation bar (static, with a tall height) also had to change. I was tasked with creating mockups for the pages in the website, as well as figuring out the design of the new About page, Menu page, and navigation bar.",
         "Initially, we were worried about lengthy submissions which would disengage the audience. Our solution to this potential issue was to institute a 250 character limit on the length of the stories users can submit. In this way, we can ensure some limitations on length while also encouraging users to concisely articulate their thoughts and opinions."
      ],
      "image-carousel": {
         "id": "carousel3",
         "img": [{
            "active": true,
            "title": "Iteration 1",
            "path": "./public/img/mwch/mockup1.png"
         },
         {
            "active": false,
            "title": "Iteration 2",
            "path": "./public/img/mwch/mockup2.png"
         },
         {
            "active": false,
            "title": "Iteration 3",
            "path": "./public/img/mwch/mockup3.png"
         }]
      }
   },
   {
      "header": "Final Prototype",
      "content": [
         "In the interim period between the mockups and the implementation of the final prototype, we went through a many design changes and tweaks. Albeit small in nature, they made a noticeable difference.",
         "The Google Map had long been a placeholder as we reasoned that UCSD students, our target users, would not find it as helpful since Muir Woods is located directly on campus. The initial idea was to create our own map—a simple graphic—that would use the surrounding buildings as local landmarks. But since Muir Woods is located underneath another building, our graphical representations seemed too abstract. In the end, we decided on a photo of the storefront, which we believed was the most informative when paired with the text directions on the right.",
         "We also replaced placeholder images with photos that showed off the more humanistic aspects of Muir Woods and the day-to-day happenings at Muir Woods. Whereas the original header image was more focused on the machine, we replaced it with a photo of a Muirista preparing a drink from the vantage point of an ordering customer."
      ],
      "link": {
            "asset": "Interactive Prototype (HTML)",
            "path": "http://noslp-mwch.herokuapp.com/"
      }
   },
   {
      "header": "Challenges",
      "content": [
         "Although we were working with our client to look into how we can make this website live, between working with UCSD's hosting services and maintaining the website, our client ultimately decided against having a website entirely. It was really disappointing to hear that, but overall, I gained valuable experience and insight into working with a client by doing this project.",
         "In terms of design, one of the biggest challenges we had was with the \"Stories\" feature. It was a feature that our client really wanted, but from our initial research, we were concerned about user engagement with the feature. If this project were to continue, I would've liked to spend more time researching the potential success of this feature (Who would or wouldn't use it? Why or why not?) and potential ways to encourage and incentivize its use.",
         "In reflection, I also would’ve liked to devote more time developing the brand further by using more graphics, photos, and animations/interactive effects to improve the overall flow of the website. There had to be a lot of compromise between our goals and the clients and so I would like to explore, develop, and refine the aesthetics, perhaps revisiting chalkboard influences."
      ]
   }
]
}
